{
    "education_title": "Education",
    "education": [
        {
            "title": "MS Computer Science",
            "institution": "Federal University of São Carlos (UFSCar)",
            "location": "Sorocaba, Brazil",
            "start_date": {
                "month": "October",
                "year": "2024"
            },
            "summary": "Thesis on background filtering algorithms for 3D object detection. Supervised by Dr. Tiago A. Almeida.",
            "long_description": "Thesis on background filtering algorithms for 3D object detection. Supervised by Dr. Tiago A. Almeida. My main contribution was the proposal of VoxelFilterNet, a novel deep learning architecture for background filtering in LiDAR point clouds. During this period, I was a volunteer researcher in the LaSID RecSys group, where I contributed to the development of recommender systems using incremental learning techniques. I was also a member of the Conecta2030 AI team project, where I implemented 3D object detection and tracking algorithms, which were applied in a digital twin and a real-world environment for predicting dangerous situations. Finally, I conducted an international internship at Technische Hochschule Ingolstadt (THI) in Germany, where I labeled point cloud data, evaluated 3D object detection, and applied the VoxelFilterNet to filter out water spray in simulated road spray scenarios."
        },
        {
            "title": "BS Computer Science",
            "institution": "Federal University of São Carlos (UFSCar)",
            "location": "Sorocaba, Brazil",
            "start_date": {
                "month": "January",
                "year": "2020"
            },
            "end_date": {
                "month": "June",
                "year": "2024"
            },
            "summary": "During my graduation, I focused on databases, massive data processing, data structures, machine learning, computer vision, and artificial intelligence disciplines, achieving grades above 9 (out of 10) in all of them. My first experience with academic research was as an undergraduate researcher initially funded by CNPQ and then by FAPESP.",
            "long_description": "During my graduation, I focused on databases, massive data processing, data structures, machine learning, computer vision, and artificial intelligence disciplines, achieving grades above 9 (out of 10) in all of them. My first experience with academic research was as an undergraduate researcher initially funded by CNPQ and then by FAPESP. During the undergraduate research, I became a member of the LaSID RecSys group. I generated embeddings using the RecVae model, used in our weighted similarities method. I implemented some optimized MAB algorithms for recommender systems, which were used in many papers for the group. These modifications originated the GOBRec library. I also elaborated and implemented the experimental protocols for evaluating incremental recommender systems, deciding how the code should be organized, and documenting all the repositories used in our papers. I wrote some sections of the published papers, contributing to the review process. I also led the development of many video games in the Maritacas Gamedev group. For a period, I was one of the coordinators of this entity, orienting beginner students as they developed their first games."
        }
    ],
    "internships_title": "Internships",
    "internships": [
        {
            "title": "Germany international interniship",
            "institution": "Technische Hochschule Ingolstadt (THI)",
            "location": "Ingolstadt, Germany",
            "start_date": {
                "month": "January",
                "year": "2020"
            },
            "summary": "International internship in Ingolstadt, Germany. During this period, I studied autonomous driving, 3D object detection, tracking, and trajectory prediction.",
            "long_description": "International internship in Ingolstadt, Germany. During this period, I studied autonomous driving, 3D object detection, tracking, and trajectory prediction. I labeled point cloud data, evaluated 3D object detection, and applied the VoxelFilterNet to filter out water spray in simulated road spray scenarios. I also helped set up the outdoor experiments, where I calibrated the sensors, set the obstacles, and analyzed some collected data. I provided a specialized 2D object detection model to the research group in their projects."
        }
    ]
}