{
    "title": "Vulnerable road user detection and safety enhancement: A comprehensive survey",
    "img_alt": "Um exemplo de situação de perigo entre um caminhão e um ciclista",
    "abstract": "Os acidentes de trânsito envolvendo usuários vulneráveis (VRUs) representam uma parcela significativa dos acidentes rodoviários globais. Os avanços nos ecossistemas de comunicação de tráfego, aliados a sofisticadas técnicas de processamento de sinais e aprendizado de máquina, têm facilitado a utilização de dados de diversos sensores. Apesar desses avanços e da disponibilidade de extensos conjuntos de dados, progressos substanciais ainda são necessários para mitigar as vítimas no trânsito. Este artigo apresenta um levantamento abrangente das tecnologias e metodologias estado da arte para aprimorar a segurança dos VRUs. O estudo investiga as redes de comunicação entre veículos e VRUs, enfatizando a integração de sensores e a disponibilidade de conjuntos de dados relevantes. São exploradas técnicas de pré-processamento e métodos de fusão de dados para melhorar a qualidade dos dados dos sensores. Além disso, nosso estudo avalia ambientes de simulação críticos, essenciais para o desenvolvimento e teste de sistemas de segurança para VRUs. Nossa pesquisa também destaca avanços recentes em algoritmos de detecção e classificação de VRUs, abordando desafios como condições ambientais adversas (chuva, neblina, etc.). Adicionalmente, abordamos pesquisas estado da arte na previsão das intenções e comportamentos dos VRUs, o que é fundamental para estratégias de prevenção de colisões. Por meio desta pesquisa, pretendemos fornecer uma compreensão abrangente do panorama atual das tecnologias de segurança para VRUs, identificando áreas de progresso e áreas que necessitam de mais pesquisa e desenvolvimento.",
    "contributions_text": "Nesta pesquisa, minha principal contribuição foi para a seção de IA do artigo. Auxiliei na seleção, leitura e resumo da literatura sobre detecção de usuários vulneráveis (VRUs) e previsão de intenções. Contribuí para a redação da seção de detecção de VRUs e fui o principal autor da seção de previsão de intenções. Também participei do extenso processo de revisão (em várias rodadas) do artigo antes de seu aceite."
}