{
    "title": "Collaborative filtering through weighted similarities of user and item embeddings",
    "img_alt": "Diagrama do sistema de recomendação Weighted Sims",
    "abstract": "Nos últimos anos, redes neurais e outros modelos complexos têm dominado nas pesquisa sobre sistemas de recomendação, frequentemente estabelecendo novos padrões de desempenho no estado da arte. Contudo, apesar desses avanços, pesquisas premiadas demonstraram que os métodos tradicionais de fatoração de matrizes podem permanecer competitivos, oferecendo simplicidade e menor sobrecarga computacional. Modelos híbridos, que combinam fatoração de matrizes com técnicas mais recentes são cada vez mais empregados para aproveitar os pontos fortes de diferentes abordagens. Este artigo propõe um novo método de *ensemble* que unifica recomendações usuário-item e item-item por meio de uma estrutura de similaridade ponderada para gerar recomendações *top-N*. Nossa abordagem se destaca pelo uso de *embeddings* compartilhados de usuários e itens para ambas as estratégias de recomendação, simplificando a arquitetura e aumentando a eficiência computacional. Experimentos extensivos em múltiplas bases de dados mostram que nosso método alcança desempenho competitivo e é robusto em diversos cenários que favorecem recomendações usuário-item ou item-item. Além disso, ao eliminar a necessidade de *fine tunning* específicos para cada *embedding*, nosso modelo permite a reutilização de hiperparâmetros do algoritmo base sem sacrificar o desempenho. Isso resulta em um método eficiente e fácil de implementar. A implementação deste modelo está publicamente disponível em https://github.com/UFSCar-LaSID/weightedsims-recommender.",
    "contributions_text": "Neste artigo, gerei *embedding*s com o modelo RecVae. Essas *embeddings* foram posteriormente utilizadas pelo nosso modelo proposto. Escrevi a documentação principal do nosso método, disponível no [repositório do GitHub](https://github.com/UFSCar-LaSID/weightedsims-recommender). Também contribui no processo de revisão do artigo."
}